Repository: yamato/perl6doc-jp
Catalog: tm/auto/S02-bits-20140914.tmx
Source language: en_us
Languages: ja

source: Code which does not depend on .perl's definition should use .gist instead to allow more control.
ja: 載って.perlがそうである依存をしないコード、定義は、より多くの支配を許すために、その代わりに.gistを使わなければならない。

source: The .gist method
ja: .gistメソッド

source: .gist, by contrast with .perl, returns a flexible form of an object intended for human interpretation.
ja: .gist、.perlとの対照によって、人間の字句解釈を意図されるオブジェクトの柔軟体は、返る。

source: Specific user classes are encouraged to override .gist to do something appropriate, and it is completely acceptable to monkey patch .gist methods while doing debugging, without risk of breaking any used module.
ja: 特定のユーザクラスは適切な何かをするために.gistにオーバーライドするのを奨励される、そして、デバッギングをしている間、それはモンキーパッチ.gistメソッドにとって完全に容認できる、何か中古のモジュールをこわす危険なしで。

source: .gist, like any method, will accept and ignore unrecognized named arguments;
ja: .gist（何かメソッドのような）は、認められていない名をつけられた引数を受け入れて、無視する;

source: implementations of .gist are encouraged to standardize on a set of flags.
ja: .gistの実装は、一組のフラグの上で標準化するように促される。

source: [Some conjectural suggestions:
ja: ［いくらかの推測的な提案：

source: Conjecturally, .gist on system-defined classes could redispatch to &amp;*PRETTYPRINTER or some similar system, allowing for a more disciplined way to change pretty formats.
ja: 推測で、より規律を守る方法がかわいいフォーマットを変えるのを許して、システム定義のクラスの.gistは、&amp;*PRETTYPRINTERまたは若干の類似したシステムにredispatchにそうすることができた。

source: It may also be desirable to use a richer format for intermediate strings than simple Str, for instance using an object format that can handle intelligent line breaking.
ja: 中間の文字列のために単純なStr（たとえば知的な行分けを取り扱うことができるオブジェクトフォーマットを用いた）より豊かなフォーマットを使うことは、望ましい場合もある。

source: However, that's probably overkill.]
ja: しかし、それは多分過剰であるだろう。］

source: The .fmt method
ja: .fmtメソッド

source: To get a formatted representation of any scalar value, use the .fmt('%03d') method to do an implicit sprintf on the value.
ja: 何かスカラー値のフォーマット化された表現を得るために、値の上で潜在的なsprintfをするために、.fmt('%03d')メソッドを使用しなさい。

source: To format an array value separated by commas, supply a second argument:
ja: コンマで区切られる配列値をフォーマット化して、2回目の引数を供給すること：

source: To format a hash value or list of pairs, include formats for both key and value in the first string:
ja: 組のハッシュ値またはリストの書式を設定して、ファーストストリングでキーと値のためにフォーマットを含むこと：

source: Subscripts
ja: 添え字

source: Subscripts now consistently dereference the container produced by whatever was to their left.
ja: 添え字は、彼らの左にあったものは何によってでも生産されるコンテナを現在一貫して間接参照する。

source: Whitespace is not allowed between a variable name and its subscript.
ja: 空白文字は、変数名とその添え字の間で許されない。

source: However, there are two ways to stretch the construct out visually.
ja: しかし、2つの方法が、視覚的に構成概念を伸ばすためにある。

source: Since a subscript is a kind of postfix operator, there is a corresponding dot form of each subscript (@foo.[1] and %bar.'a') that makes the dereference a little more explicit.
ja: 添え字が一種の後置演算子であるので、もう少し間接参照を明示的にする各々の添え字（@foo.[1]と%bar.'a'）の対応する点の形態がある。

source: Constant string subscripts may be placed in angles, so %bar.'a' may also be written as %bar&lt;a&gt; or %bar.&lt;a&gt;.
ja: 定数列添え字は角度に置かれるかもしれないので、%bar.'a'は%bar&lt;a&gt;または%bar.&lt;a&gt;としても書かれるかもしれない。

source: Additionally, you may insert extra whitespace using the unspace.
ja: その上、あなたは、unspaceを使っている余分の空白文字を付け加えるかもしれない。

source: Slicing is specified by the nature of the subscript, not by the sigil.
ja: シギルによってでなく、スライスは添え字の性質によって指定される。

source: Subscripts have list context
ja: 添え字には、リストコンテキストがある

source: The context in which a subscript is evaluated is no longer controlled by the sigil either.
ja: 添え字が評価される前後関係は、シギルによってももはやコントロールされない。

source: Subscripts are always evaluated in list context.
ja: 添え字は、常にリストコンテキストで評価される。

source: (More specifically, they are evaluated in a variant of list context known as lol context (List of List), which preserves dimensional information so that you can do multi-dimensional slices using semicolons.
ja: （より詳しくは、それらはlol前後関係（リストのリスト）として知られているリストコンテキストの変形で評価される。そして、あなたがセミコロンを使っている多次元スライスをすることができるように、それは次元の情報を保存する。

source: However, each slice dimension evaluates its sublist in normal list context, so functions called as part of a subscript don't see a lol context.
ja: しかし、各々のスライス次元は通常のリストコンテキストでそのサブリストを評価するので、添え字の一部として呼ばれる関数はlol前後関係がわからない。

source: See S09 for more on slicing.)
ja: スライスの詳細についてS09を見なさい。）

source: If you need to force inner context to item (scalar), we now have convenient single-character context specifiers such as + for numbers and ~ for strings:
ja: あなたがアイテム（段階的な）に内部の前後関係を強制する必要があるならば、我々には現在文字列のために数と~のために+のような便利な単一キャラクター前後関係指示子がある：

source: Sigils used as functions with parenthesis also force context, so these also work:
ja: 括弧に対する関数としても使われるシギルは前後関係を強制するので、これらも動く：

source: But note that these don't do the same thing:
ja: しかし、これらが同じことをしない点に注意する：

source: Array and Hash variables can be evaluated in item context by prefixing them with a single dollar sign:
ja: 配列とハッシュ変数は、一つのドル記号でそれらを前に置くことによって、アイテム前後関係で評価されることができる：

source: List assignment and binding
ja: リスト割当てとバインディング

source: There is a need to distinguish list assignment from list binding.
ja: リスト割当てとリストバインディングを区別する必要が、ある。

source: List assignment works much like it does in Perl 5, copying the values.
ja: それがPerl 5でするように、リスト割当ては非常に動く。そして、値をコピーする。

source: There's a new := binding operator that lets you bind names to Array and Hash objects without copying, in the same way as subroutine arguments are bound to formal parameters.
ja: サブルーチン引数が仮パラメータの束縛を受けるのと同じ方法では、あなたにならい削りなしで名前をArrayとHashオブジェクトに結びつけさせる新しい:=結合性演算子が、ある。

source: See S06 for more about binding.
ja: バインディングについてより多くについてはS06を見なさい。

source: Parcels
ja: パーセル

source: A list of zero or more comma-separated objects may be grouped together by parentheses into a &quot;parenthesis cell&quot;, or Parcel.
ja: 0以上コンマで区切られたオブジェクトのリストは、「括弧セル」またはParcelに括弧によって集められるかもしれない。

source: This kind of list should not be confused with the flattening list context.
ja: この種のリストは、平坦化リストコンテキストと混同されてはならない。

source: Instead, this is a raw syntactic list that has not yet committed to flattening;
ja: その代わりに、これは、平らになることにまだ専念しなかった荒々しい構文法のリストである;

source: no interpretation is made of the list inside without knowing what context it will be evaluated in. For example, when you say:
ja: 字句解釈は、あなたが以下のように言うとき、例えば、それがそうであるどんな前後関係がインチを評価したかわかっていることなく、リストで中でできていない：

source: the result is a Parcel object containing three Int objects and a Pair object, that is, four positional objects.
ja: 結果は、3つのIntオブジェクトとPairオブジェクト（つまり、4つの位置オブジェクト）を含んでいるParcelオブジェクトである。

source: When, however, you say something like:
ja: しかし、あなたが以下のような何かを言うとき：

source: the syntactic Parcel is translated (at compile time, in this case) into a Capture object with three positionals and one named argument in preparation for binding.
ja: 構文法のParcelは、バインディングに備えて3つのpositionalsと1つの挙げられた引数でCaptureオブジェクトに変形される（本例で、コンパイル時で）。

source: More generally, a parcel is transmuted to a capture any time it is bound to a complete signature.
ja: より通常、それが完全なシグネチャの束縛を受ける何か時、パーセルはキャプチャーに変えられる。

source: You may force immediate conversion to a Capture object by prefixing the parcel composer with a backslash:
ja: あなたは、バックスラッシュでパーセルコンポーザーを前に置くことによって、Captureオブジェクトへの即時の転換を強制するかもしれない：

source: Unlike Capture objects, Parcel objects are ephemeral, insofar as the user almost never sees one as a real standalone object, since binding or assignment always turns a parcel into something else.
ja: Captureオブジェクトとは異なり、バインディングまたは割当てが常にパーセルを何か他のものに変える時から、ユーザーが1つを本当の独立型オブジェクトとほとんどみなさない限り、Parcelオブジェクトは短命である。

source: A parcel may generally only be preserved as a part of an outer parcel or capture object.
ja: パーセルは、通常、外のパーセルの一部またはキャプチャーオブジェクトとして保たれるだけかもしれない。

source: Individual arguments in a parcel or capture composer are parsed as ordinary expressions, and any functions mentioned are called immediately, with each function's results placed as an argument (often a subparcel, if the function returns multiple values) within the outer parcel (or capture).
ja: パーセルまたはキャプチャーコンポーザーの個々の引数は普通の表現として解析される、そして、各機能の結果が外のパーセル（またはキャプチャー）の中の引数（しばしばsubparcelファンクションリターン多値ならば）とわかって、記載の何か関数はすぐに呼ばれる。

source: Whether any given argument is flattened will depend on its eventual binding, and in general cannot be known at parcel/capture composition time.
ja: 何かされた引数が平らにされるかどうかはその最終的なバインディングに依存する、そして、中で、一般はパーセル/キャプチャー構成時間にわかっていることができない。

source: We use &quot;argument&quot; here to mean anything that would be taken as a single argument if bound to a positional or named parameter:
ja: 我々は、位置であるか挙げられたパラメータに密接に結びつくならば、一回の引数としてとられるだろう何でも意味するために、「引数」をここで使う：

source: In these examples, the first argument to the function is a parcel in all but the first case, where it is simply the literal integer 1.
ja: これらの例では、関数に対する最初の引数は最初のケース以外はのパーセルである、そこで、それは単に文字通りの整数1である。

source: An argument is either of:
ja: 引数は、以下のどちらでもある：

source: * A parcel that groups together a sublist, or
ja: * サブリストを集めるパーセル、または、

source: * Any other object that can function as a single argument.
ja: * 一回の引数として機能することができる他のどのオブジェクトも。

source: Looking at it the other way, all arguments that don't actually need to be wrapped up in a parcel are considered degenerate parcels in their own right when it comes to binding.
ja: その他の方法でそれを見て、実はパーセルに包まれる必要はないすべての引数は、バインディングに関しては右のよく考えた退歩したパーセルである。

source: Note that a capture is not considered a kind of parcel, so does not flatten in flat context.
ja: キャプチャーがパーセルの1種類考えられなくて、それで、平らな前後関係で平らにならないことに注意すべきである。

source: Parcels, parameters, and Captures
ja: パーセル、パラメータとキャプチャー

source: When a Parcel is bound to a parameter, the behavior depends on whether the parameter is &quot;flattening&quot; or &quot;argumentative&quot;.
ja: Parcelがパラメータの束縛を受けるとき、ふるまいはパラメータが平らになっているか、論争好きかどうか次第である。

source: Positional parameters and slice parameters are argumentative and call .getarg on the internal iterator and just return the next syntactic argument (parcel or other object) without flattening.
ja: 位置パラメーターとスライスパラメータは、論争好きで、内部の反復子で.getargを呼んで、ちょうど平らになることなく、次の構文法の引数（パーセルまたは他のオブジェクト）を返る。

source: (A slice differs from an ordinary positional parameter in being &quot;slurpy&quot;, that is, it is intended to fetch multiple values from the variadic region of the surrounding capture.
ja: （スライスは普通の位置パラメーターと「slurpy」であることにおいて異なる、つまり、それは周囲のキャプチャーのvariadicな地域から多値を取ってくることを意図される。

source: Slurpy contexts come in both flattening (* parameters) and slicing (** parameters) forms.)
ja: Slurpy前後関係は、平らになって（*パラメータ）、形をスライスして（**パラメータ）入る。）

source: The fact that a parameter is being bound implies that there is an outer capture being bound to a signature.
ja: パラメータが結びつけられているという事実は、シグネチャに密接に結びついている外のキャプチャーがあることを意味する。

source: The capture's iterator provides a .get and a .getarg method to tell the iterator what context to bind in. For positional/slice parameters, the .getarg method returns the entire next argument from the iterator.
ja: キャプチャーの反復子は、どんな前後関係で結合するべきかについて、反復子に話すために、.getと.getargメソッドを提供する。位置/スライスパラメータについては、.getargメソッドは、反復子から全ての次の引数を返る。

source: It returns other objects unchanged.
ja: それは、他のオブジェクトに不変であると返る。

source: In contrast, flat parameters call .get on the capture's iterator, which flattens any subparcels before pulling out the next item.
ja: 対照的に、平らなパラメータはキャプチャーの反復子で.getを呼ぶ。そして、それは次項を引き抜く前に何かsubparcelsを平らにする。

source: In either case, no bare parcel object is seen as a normal bound argument.
ja: いずれにせよ、裸のパーセルオブジェクトは、通常の縛られた引数とみなされない。

source: (There is a way to bind the underlying parcel using backslash, however.
ja: （方法が、しかし、バックスラッシュを使っている根底にあるパーセルを結びつけるためにある。

source: This is how internal routines can deal with parcels as real objects.)
ja: これは、内部のルーチンが実物体としてパーセルに対処することができる方法である。）

source: In contrast to parameter binding, if a Parcel is bound to an entire signature (typically as part of a function or method call), it will be transformed first into a capture object, which is much like a parcel but has its arguments divvied up into positional and named subsets for faster binding.
ja: パラメータ結合と対照的に、Parcelが全てのシグネチャ（一般的に関数またはメソッドの一部として電話しなさい）の束縛を受けるならば、それは最初にキャプチャーオブジェクトに変わる。そして、それは非常にパーセルのようであるが、その引数をより変わらぬバインディングのために位置で名をつけられたサブセットに分けておく。

source: (Usually this transformation happens at compile time.) If the first positional is followed by a colon instead of a comma, it is marked as the invocant in case it finds itself in a context that cares.
ja: 位置最初の後にコンマの代わりにコロンが続くならば、気にかける前後関係にいるのに気づく場合に備えて、それはインボカントとして跡を残される（通常、この変化はコンパイル時で起こる。）。

source: It's illegal to use the colon in place of the comma anywhere except after the first argument.
ja: 最初の引数の後あること以外は、どこでもコンマの代わりにコロンを使うことは無効である。

source: Explicit binding to an individual variable is considered a form of signature binding, which is to say a declarator puts implicit signature parens around the unparenthesized form:
ja: 個別変数へのバインディングがそうである完はシグネチャバインディングの形を考えた。そして、それは宣言がunparenthesizedされた形のまわりに潜在的なシグネチャ括弧を置くと言うことになっている：

source: The parens are, of course, required if there is more than one parameter.
ja: 複数のパラメータがあるならば、括弧は、もちろん、必要とされる。

source: Capture objects are immutable in the abstract, but evaluate their arguments lazily.
ja: Captureオブジェクトは抽象的に不変であるが、ゆったりと彼らの引数を評価する。

source: Before everything inside a Capture is fully evaluated (which happens at compile time when all the arguments are constants), the eventual value may well be unknown.
ja: Captureの中のすべてが完全に評価される（すべての引数が定数であるときコンパイル時で起こる）前に、最終的な値は知られていないだろう。

source: All we know is that we have the promise to make the bits of it immutable as they become known.
ja: 我々が知っているすべては、それらが明らかとなって、我々にはそれのビットを不変にするという約束があるということである。

source: Capture objects may contain multiple unresolved iterators such as feeds or parcels or lists of parcels.
ja: Captureオブジェクトは、複数の未解決の反復子（例えばパーセルの飼料またはパーセルまたはリスト）を含むかもしれない。

source: How these are resolved depends on what they are eventually bound to.
ja: これらが解決される方法は、結局、それらが密接に結びつくもの次第である。

source: Some bindings are sensitive to multiple dimensions while others are not.
ja: 他がそうでない間、若干のバインディングは複数の次元に敏感である。

source: Binding to a list of lists is often known as &quot;slicing&quot;, because it's commonly used to index &quot;slices&quot; of a potentially multi-dimensional array.
ja: それが潜在的に多次元配列のインデックス「スライス」に一般的に用いられるので、リストのリストへのバインディングは「スライス」としてしばしば知られている。

source: You may retrieve parts from a Capture object with a prefix sigil operator:
ja: あなたは、接頭辞シギル演算子でパーツをCaptureオブジェクトから取り出すかもしれない：

source: When cast into an array, you can access all the positional arguments;
ja: 配列にキャストされるとき、あなたはすべての位置引数にアクセスすることができる;

source: into a hash, all named arguments.
ja: ハッシュに、すべては引数に名をつけた。

source: All prefix sigil operators accept one positional argument, evaluated in item context as a rvalue.
ja: すべての接頭辞シギル演算子は1つの位置引数に応じる。そして、rvalueとしてアイテム前後関係で評価される。

source: They can interpolate in strings if called with parentheses.
ja: 括弧で呼ばれるならば、それらは文字列で改竄することができる。

source: The special syntax form $() translates into $( $.made // Str($/) ) to operate on the current match object;
ja: $()が現在のマッチオブジェクトに作用するために$( $.made // Str($/) )に変形する特別な構文用紙;

source: similarly @() and %() can extract positional and named submatches.
ja: 同様に、@()と%()は、位置で名をつけられたsubmatchesを抽出することができる。

source: Parcel and Capture objects fill the ecological niche of references in Perl 6.
ja: ParcelとCaptureオブジェクトは、引用の生態的地位をPerl 6で満たす。

source: You can think of them as &quot;fat&quot; references, that is, references that can capture not only the current identity of a single object, but also the relative identities of several related objects.
ja: あなたは、それらを、「ずんぐりした」引用（つまり、一つのオブジェクトのも現在のアイデンティティだけでなく、いくつかの関連オブジェクトの相対的なアイデンティティも捕えることができる引用）とみなすことができる。

source: Conversely, you can think of Perl 5 references as a degenerate form of Capture when you want to refer only to a single item.
ja: 反対に、あなたは、一つのアイテムだけに言及したいCaptureの退歩した形として、Perlの5つの引用を考えることができる。

source: The sink statement prefix will eagerly evaluate any block or statement, throw away the results, and instead return the empty Parcel value, ().
ja: sink文接頭語は、熱心に何かブロックまたは文を評価して、結果を捨てて、その代わりに空のParcel値（()）を返る。

source: This can be useful to peg some behavior to an empty list while still returning an empty list:
ja: まだ空きリストを返る間、これはいくらかのふるまいを空きリストに留めるために役に立つことがありえる：

source: Given sink, there's no need for an &quot;else&quot; clause on Perl 6's loops, and the sink construct works in any list, not just for loops.
ja: sinkを与える、必要がない。そして、他に、Perl 6に関する条項は輪になる、そして、sinkは何かリスト（ちょうどforループでない）で作業を造る。

source: A CaptureCursor object is a view into another capture with an associated start position.
ja: CaptureCursorオブジェクトは、関連した開始位置によるもう一つのキャプチャーへの見方である。

source: Such a cursor is essentially a pattern-matching state.
ja: そのようなカーソルは、基本的にパターンマッチング州である。

source: Capture cursors are used for operations like grep and map and for loops that need to apply a short signature multiple times to a longer list of values supplied by the base capture.
ja: キャプチャーカーソルが、複数回短いシグネチャをベースキャプチャーによって供給される値のより長いリストに適用する必要があるgrepとmapとforループのような演算のために使われる。

source: When we say &quot;capture&quot; we sometimes mean either Capture or CaptureCursor.
ja: 「キャプチャー」を言うとき、我々はCaptureかCaptureCursorを時々意味する。

source: CaptureCursors are also immutable.
ja: CaptureCursorsも、不変である。

source: When pattern matching a signature against a cursor, you get a new cursor back which tells you the new position in the base capture.
ja: カーソルとシグネチャを比べることをパターン化するとき、あなたはベースキャプチャーであなたに新しい位置を教える新しいカーソルを取り戻す。

source: Signature objects
ja: シグネチャオブジェクト

source: A signature object (Signature) may be created with colon-prefixed parens:
ja: シグネチャオブジェクト（Signature）は、コロンを前に置かれた括弧で作成されるかもしれない：

source: Expressions inside the signature are parsed as parameter declarations rather than ordinary expressions.
ja: シグネチャの表現は、普通の表現よりもむしろパラメタ宣言として解析される。

source: See S06 for more details on the syntax for parameters.
ja: パラメータのために構文上で詳細はS06を見なさい。

source: Declarators generally make the colon optional:
ja: 宣言は、コロンを一般にオプションにする：

source: Signature objects bound to type variables (as in the example above) may be used within other signatures to apply additional type constraints.
ja: 変数（上の例の場合のように）を入力するにちがいないシグネチャオブジェクトが、更なる型制約を適用するために、他のシグネチャの範囲内で使われるかもしれない。

source: When applied to a capture argument, the signature allows you to take the types of the capture's arguments from MySig, but declare the (untyped) variable names yourself via an additional signature in parentheses:
ja: キャプチャー引数に適用されるとき、シグネチャはMySigからキャプチャーの引数の型をとるが、（untypedされた）変数名を括弧の更なるシグネチャを経た自分自身と宣言することができる：

source: Ampersand and invocation
ja: アンパサンドと起動

source: Unlike in Perl 5, the notation &amp;foo merely stands for the foo function as a Routine object without calling it.
ja: Perl 5のとは異なり、表記法&amp;fooは、それを呼ぶことのないRoutineオブジェクトとして、単にfoo関数を表すだけである。

source: You may call any Code object by dereferencing it with parens (which may, of course, contain arguments):
ja: あなたは、何でも括弧（もちろん、引数を含むかもしれない）でそれを間接参照することによるCodeオブジェクトと呼ぶかもしれない：

source: Whitespace is not allowed before the parens because it is parsed as a postfix.
ja: それが接尾辞として解析されるので、空白文字は括弧の前に許されない。

source: As with any postfix, there is also a corresponding .() operator, and you may use the &quot;unspace&quot; form to insert optional whitespace and comments between the backslash and either of the postfix forms:
ja: 何か接尾辞と同様に、対応する.()演算子もある、そして、あなたはバックスラッシュと接尾辞の形態のどちらの間ででもオプションの空白文字とコメントを付け加えるためにunspaceの形を使用するかもしれない：

source: Note however that the parentheses around arguments in the &quot;normal&quot; named forms of function and method calls are not postfix operators, so do not allow the .() form, because the dot is indicative of an actual dereferencing operation, which the named forms aren't doing.
ja: しかし、関数とメソッド呼び出しの「通常の」挙げられた形の引数のあたりの括弧が後置演算子でない点に注意しなさいので、点が実際の間接参照演算を示すので、.()の形を許してはいけない、そしてそれは、挙げられた形はしていない。

source: You may, however, use &quot;unspace&quot; to install extra space before the parens in the forms:
ja: しかし、あなたは、形で括弧の前に余分のスペースをインストールするために、「unspace」を使うかもしれない：

source: If you do use the dotty form on these special forms, it will assume you wanted to call the named form without arguments, and then dereference the result of that.
ja: あなたがこれらの特殊形式でおかしい形を使用するならば、それはあなたが引数のない挙げられた形、そして、間接参照をそれの結果と言いたかったと仮定する。

source: Specifying a dispatch candidate
ja: ディスパッチ候補を指定すること

source: With multiple dispatch, &amp;foo is actually the name of a dispatch routine (instantiated from a proto) controlling a set of candidate functions (which you can use as if it were an ordinary function, because a dispatch is really an only function with pretensions to management of a dispatcher).
ja: 複数のディスパッチで、&amp;fooは実は、一組の候補関数（あなたがそれが普通の関数であったことをように扱うことができるdispatchが本当にディスパッチャの管理の主張によるonly関数であるので）を制御しているdispatchルーチン（protoから具体例をあげて示される）の名前である。

source: However, in that case &amp;foo by itself is not sufficient to uniquely name a specific function.
ja: しかし、その場合、&amp;fooはユニークに特殊関数を挙げるのに単独で十分でない。

source: To do that, the type may be refined by using a signature literal as a postfix operator:
ja: そうするために、型は後置演算子として文字通りのシグネチャを用いて洗練されているかもしれない：

source: Use of a signature that does not unambiguously select a single multi results in failure.
ja: 一つのマルチも明白に選ばないシグネチャの使用は、結果として失敗になる。

source: It still just returns a Routine object.
ja: それは、まだちょうどRoutineオブジェクトを返る。

source: A call may also be partially applied (primed) by using the .assuming method:
ja: 呼び出しは、.assumingメソッドを用いて部分的に適用されもするかもしれない（準備をされる）：

source: Multidimensional slices and parcels
ja: 多次元スライスとパーセル

source: Slicing syntax is covered in S09.
ja: 構文をスライスすることは、S09でカバーされる。

source: A multidimensional slice will be done with semicolons between individual slice sublists.
ja: 多次元スライスは、個々のスライスサブリストの間でセミコロンでされる。

source: The semicolons imply one extra level of tree-ness, where the top list is of type LoL and sublists are Listss (or non-iterable items that can function as single-item parcels).
ja: セミコロンはさらに1レベルの木-みさきを意味する、そこで、トップリストは型LoLである、そして、サブリストはListss（または一つのアイテムパーセルとして機能することができる非iterableなアイテム）である。

source: So when you say
ja: それで、あなたが言うとき、

source: really means
ja: 本当に手段

source: Each such slice sub-parcel is evaluated lazily.
ja: 各スライス下位パーセルは、ゆったりと評価される。

source: Subscript adverbs
ja: 下に書いた副詞

source: To make a slice subscript return something other than values, append an appropriate adverb to the subscript.
ja: スライス添え字復帰に値以外の何かを作るために、添え字に適正副詞を追加しなさい。

source: These adverbial forms all weed out non-existing entries if the adverb is true;
ja: 副詞が真実であるならば、これらの副詞形は非既存のエントリーをすべて除く;

source: if not, they leave them in, just as an ordinary slice would.
ja: もしそうでなければ、ちょうど普通のスライスがそうして、それらはそれらを入れたままにしておく。

source: Likewise,
ja: 同様に、

source: deletes the entries en passant while returning them.
ja: それらを返っている間、ついでにエントリーを削除する。

source: (Of course, any of these forms also work in the degenerate case of a slice containing a single index.) Note that these forms work by virtue of the fact that the subscript is the topmost previous operator.
ja: なお、これらの形は、添え字が一番上の前の演算子であるという事実によって動く（もちろん、これらの形のどれでも、一つのインデックスを含んでいるスライスの退歩したケースで動く。）。

source: You may have to parenthesize or force list context if some other operator that is tighter than comma would appear to be topmost:
ja: あなたは、コンマより別のよりきつい若干の演算子がそうであるように見えるリストコンテキストもしもを括弧に入れなければならないかもしれないか、強制しなければならないかもしれない一番上の：

source: (The situation does not often arise for the slice modifiers above because they are usually used in list context, which operates at comma precedence.)
ja: （それらが通常リストコンテキストで使われるので、状況は上のスライス修飾子のためにしばしば起こらない。そして、それはコンマ優先順位で動く。）

source: The element is deleted only if the adverb is true.
ja: 副詞が真実の場合だけ、要素はアンインストール済みである。

source: While :!delete is essentially a no-op;
ja: :!deleteが基本的にノーオペレーションである間;

source: you could conditionally delete entries en passant based on passing a flag such as in :delete($kill'em).
ja: あなたは、例えば:delete($kill'em)でフラグを渡すことに基づくエントリーアンパッサンを条件つきで削除することができた。

source: In either case, the values are returned.
ja: いずれにせよ、値は返納印である。

source: You may also perform an existence test, either on a single item or a junction of items:
ja: アイテムの一つの条項または交差点で、あなたは存在テストも行うかもしれない：
